In [1]:
import pandas as pd

In [8]:
roll = pd.Series([1,2,3,4,5,6,7,8,9,10])
name = pd.Series(['akku','kavya','musudu','sanskruti','sania','ayush','aditya','vedant','chaitanya','meghana'])
marks = pd.Series([76, 32,66,98,40,59,30.33,70,90,45])
classs = pd.Series(['BE','TE','BE','TE','TE','BE','TE','BE','E','TE'])
age = pd.Series([16,16,17,18,20,17,17,18,19,16])

In [9]:
df = pd.DataFrame({
    'roll': roll,
    'name': name,
    'marks': marks,
    'classs': classs,
    'age': age
})

In [10]:
df

   roll       name  marks classs  age
0     1       akku  76.00     BE   16
1     2      kavya  32.00     TE   16
2     3     musudu  66.00     BE   17
3     4  sanskruti  98.00     TE   18
4     5      sania  40.00     TE   20
5     6      ayush  59.00     BE   17
6     7     aditya  30.33     TE   17
7     8     vedant  70.00     BE   18
8     9  chaitanya  90.00      E   19
9    10    meghana  45.00     TE   16

KeyError: 'class'

In [7]:
df.columns

Index(['roll', 'name', 'marks', 'classs', 'age'], dtype='object')

In [12]:
df['marks']

0    76.00
1    32.00
2    66.00
3    98.00
4    40.00
5    59.00
6    30.33
7    70.00
8    90.00
9    45.00
Name: marks, dtype: float64

In [13]:
df.columns = df.columns.str.strip()

In [15]:
df.columns

Index(['roll', 'name', 'marks', 'classs', 'age'], dtype='object')

In [16]:
df.columns = df.columns.str.upper()

In [17]:
df.columns

Index(['ROLL', 'NAME', 'MARKS', 'CLASSS', 'AGE'], dtype='object')

In [18]:
df['name'] = df['name'].str.title()

KeyError: 'name'

In [19]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
dtype: bool

In [20]:
df.duplicated().sum()

0

In [23]:
df.drop_duplicates(inplace = True)

In [24]:
df

   ROLL       NAME  MARKS CLASSS  AGE
0     1       akku  76.00     BE   16
1     2      kavya  32.00     TE   16
2     3     musudu  66.00     BE   17
3     4  sanskruti  98.00     TE   18
4     5      sania  40.00     TE   20
5     6      ayush  59.00     BE   17
6     7     aditya  30.33     TE   17
7     8     vedant  70.00     BE   18
8     9  chaitanya  90.00      E   19
9    10    meghana  45.00     TE   16

In [25]:
df.dropna()

   ROLL       NAME  MARKS CLASSS  AGE
0     1       akku  76.00     BE   16
1     2      kavya  32.00     TE   16
2     3     musudu  66.00     BE   17
3     4  sanskruti  98.00     TE   18
4     5      sania  40.00     TE   20
5     6      ayush  59.00     BE   17
6     7     aditya  30.33     TE   17
7     8     vedant  70.00     BE   18
8     9  chaitanya  90.00      E   19
9    10    meghana  45.00     TE   16

In [28]:
df ['MARKS'].fillna(60)

0    76.00
1    32.00
2    66.00
3    98.00
4    40.00
5    59.00
6    30.33
7    70.00
8    90.00
9    45.00
Name: MARKS, dtype: float64

In [29]:
m = df.mean()

TypeError: Could not convert ['akkukavyamusudusanskrutisaniaayushadityavedantchaitanyameghana'
 'BETEBETETEBETEBEETE'] to numeric

In [30]:
df['MARKS'].fillna(df['MARKS'].mean())

0    76.00
1    32.00
2    66.00
3    98.00
4    40.00
5    59.00
6    30.33
7    70.00
8    90.00
9    45.00
Name: MARKS, dtype: float64

In [31]:
df.fillna(method = 'pad')

C:\Users\Aakanksha\AppData\Local\Temp\ipykernel_8532\2275225546.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method = 'pad')

   ROLL       NAME  MARKS CLASSS  AGE
0     1       akku  76.00     BE   16
1     2      kavya  32.00     TE   16
2     3     musudu  66.00     BE   17
3     4  sanskruti  98.00     TE   18
4     5      sania  40.00     TE   20
5     6      ayush  59.00     BE   17
6     7     aditya  30.33     TE   17
7     8     vedant  70.00     BE   18
8     9  chaitanya  90.00      E   19
9    10    meghana  45.00     TE   16

In [32]:
df.isnull().sum()

ROLL      0
NAME      0
MARKS     0
CLASSS    0
AGE       0
dtype: int64

In [33]:
df.fillna(method = 'backfill', inplace = True)

C:\Users\Aakanksha\AppData\Local\Temp\ipykernel_8532\3417865302.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method = 'backfill', inplace = True)

In [34]:
df

   ROLL       NAME  MARKS CLASSS  AGE
0     1       akku  76.00     BE   16
1     2      kavya  32.00     TE   16
2     3     musudu  66.00     BE   17
3     4  sanskruti  98.00     TE   18
4     5      sania  40.00     TE   20
5     6      ayush  59.00     BE   17
6     7     aditya  30.33     TE   17
7     8     vedant  70.00     BE   18
8     9  chaitanya  90.00      E   19
9    10    meghana  45.00     TE   16